---
type: SpatialElementBoundaryOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# SpatialElementBoundaryOptions

`Autodesk.Revit.DB.SpatialElementBoundaryOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SpatialElementBoundaryOptions | 2012 | `public SpatialElementBoundaryOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SpatialElementBoundaryLocation | 2012 | `public SpatialElementBoundaryLocation SpatialElementBoundaryLocation { get ; set ; }` |
| Property | StoreFreeBoundaryFaces | 2012 | `public bool StoreFreeBoundaryFaces { get ; set ; }` |